app/controllers/api/v1/ads_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?)  [["id", 2], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
      def index
        @ads = if params[:search].present?
                 Ad.includes(:user, :category).where('name LIKE ?', "%#{params[:search]}%")

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Bonsaï"], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Bonsaï"], ["created_at", "2024-03-28 00:01:59.022281"], ["updated_at", "2024-03-28 00:01:59.022281"]]
---
      def create
        category_name = params[:category_name]
        category = Category.find_by(name: category_name)

        @ad = current_user.ads.build(ad_params)
        @ad.category_id = category.id

        if @ad.save