app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find(payload['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]