app/controllers/signin_controller.rb

  def create # rubocop:disable Metrics/AbcSize,Metrics/MethodLength
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "valentin.beaussart@gmail.com"], ["LIMIT", 1]]